_notes/_posts/language/2016-08-13-deutsch-benoetigen.org
#+BEGIN_HTML
---
layout: post
title:  單詞本：德語單詞 benötigen
categories: [language]
tags: [Deutsch]
---
#+END_HTML

讀德國人寫的代碼的時候在注釋終於到這個單詞： benötigen（ to need, to require^en
，avoir besoin de^fr ）[fn:1] 。

* benötigen

benötigen 是由 nötig 增加前後綴生成的一個動詞： be- + nötig + -en。

** nötig

形容詞“必需的”，“必不可少的”，“急需的”，necessary^en。比如
- Es ist nötig, ein Handwerk zu erlernen. It is necessary to learn a
  handicraft.
- Danke, es ist nicht nötig. Thanks, it is not necessary.
- Schnelle Hilfe ist nötig. First aid is required.

這個詞和英語的 needy，瑞典語的 nödig 應該都是來自同一個古單詞，意義為“急需”：
- The needy advertise themselves, and how much they want. 急需錢的人向大家公佈，
  并告知需要多少金錢。
- He gave away a part of his income to his needy friends. 他將自己部分收入送給急
  需的朋友。

** nötigen

動詞形式的 nötigen 則有強迫，勸請客的意思：
- Er nötigte den Freund zur Mahlzeit. 他一再要求請他朋友去吃飯。

** 德語前綴 be-

德語前綴 “be-” 可以改變動詞的性質，主要有如下幾個作用：

第一， macht in Bildungen mit intransitiven Verben diese transitiv，可以使不及物
動詞變成及物動詞，比如：antworten（回答）, beantworten（答復）, urteilen（判斷，
評價）, beurteilen（評價某物，鑒定某事）[fn:2]

- Ich wusste *auf* seine Frage sofort antworten.　我要對他的問題立刻做出回答。（不及物動詞）
- Er beantwortet die Fragen blitzschnell.　他很快便回答了這個問題。（及物動詞）
- Wer es nicht versucht, kann nicht urteilen. 不嘗試就無法評判。（不及物動詞）
- Wie beurteilen Sie Ihre Fitness? 你如何評價你的健康狀況？（及物動詞）

第二，macht in Bildungen mit transitiven Verben mit Präpositionalobjekt dieses
zum Akkusativobjekt，通過添加 be- 使得及物動詞的支配關係發生變化。沒有 be- 的及
物動詞直接支配第四格的賓語，而添加 be- 之後則先作用于第三格賓語再作用於第四格賓
語：
- Die Vögel bauen ihre Nester. 小鳥築巢。這裡的 bauen 是接受第四格賓語的動詞。
- Er bebaut die Erde mit Kartoffeln. 他種在土裡一棵土豆。這裡的 bebauen 就是配合
  第三格賓語＋第四格賓語的動詞啦。

第三，When used with a verb that is already a transitive verb, it will change
the focus of the relationship.[fn:3] 改變及物動詞動作的關注點。比如 Ich streue
Salz auf mein Mettbrötchen. 我撒鹽在我的肉餡小麵包上。Ich bestreue mein
Mettbrötchen mit Salz. 我撒我的肉餡小麵包，用鹽。實在是有些費解，據說德國人也搞
不清楚，其實就是一種約定俗成的語言習慣。


在分析了 nötig，nötigen 和 be- 之後，回到 benötigen 的探討。nötigen 好像是側重於
對人的要求，或者說對主動主體的要求，而 benötigen 則側重於對被動主體的要求。換句
話說，nötigen 是對人的要求，而 benötigen 是對物的要求。有點像中文中的“必須”和“必
需”的區別。

- Man benötigt ein Visum zur Einreise. 人們必需簽證才可入境。
- Für diese Aufgabe benötigen wir jemanden mit besonderen Qualitäten. 對於此項任
  務，我們必需專業的資質。
- Er nötigte den Freund zur Mahlzeit. 他一定要求請（必須）朋友去吃飯。
- Er war zu der Unterschrift genötigt worden. 他被迫（被必須）簽了字。


* Deviation

** Nötigung

duress^en，監禁，coercion^en，壓制，compulsion^en，強迫行為。

- Er wurde wegen Nötigung verurteilt. 他因侵犯他人而被判刑。
- sexuelle Nötigung: sexual assault^en，侵犯。

** benötigte

required^en，必需的

- nicht mehr benötigte Arbeiter，冗餘員工
- benötigte Reserven，required reserves


* Footnotes

[fn:1] http://en.wiktionary.org/wiki/ben%C3%B6tigen

[fn:2] http://www.dedecn.com/inhalte/deutsch/deyucihui/20091231468.html

[fn:3] https://www.quora.com/Does-the-prefix-be-in-German-mean-something
