_site/2016-08-13-deutsch-benoetigen.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>單詞本：德語單詞 benötigen</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>單詞本：德語單詞 benötigen </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>13 August 2016</span>
    </div>
    <div class="content">
      <p>
讀德國人寫的代碼的時候在注釋終於到這個單詞： benötigen（ to need, to require<sup>en</sup>
，avoir besoin de<sup>fr</sup> ）<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 。
</p>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> benötigen</h2>
<div class="outline-text-2" id="text-1">
<p>
benötigen 是由 nötig 增加前後綴生成的一個動詞： be- + nötig + -en。
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> nötig</h3>
<div class="outline-text-3" id="text-1-1">
<p>
形容詞“必需的”，“必不可少的”，“急需的”，necessary<sup>en</sup>。比如
</p>
<ul class="org-ul">
<li>Es ist nötig, ein Handwerk zu erlernen. It is necessary to learn a
handicraft.</li>
<li>Danke, es ist nicht nötig. Thanks, it is not necessary.</li>
<li>Schnelle Hilfe ist nötig. First aid is required.</li>
</ul>

<p>
這個詞和英語的 needy，瑞典語的 nödig 應該都是來自同一個古單詞，意義為“急需”：
</p>
<ul class="org-ul">
<li>The needy advertise themselves, and how much they want. 急需錢的人向大家公佈，并告知需要多少金錢。</li>
<li>He gave away a part of his income to his needy friends. 他將自己部分收入送給急需的朋友。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> nötigen</h3>
<div class="outline-text-3" id="text-1-2">
<p>
動詞形式的 nötigen 則有強迫，勸請客的意思：
</p>
<ul class="org-ul">
<li>Er nötigte den Freund zur Mahlzeit. 他一再要求請他朋友去吃飯。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> 德語前綴 be-</h3>
<div class="outline-text-3" id="text-1-3">
<p>
德語前綴 “be-” 可以改變動詞的性質，主要有如下幾個作用：
</p>

<p>
第一， macht in Bildungen mit intransitiven Verben diese transitiv，可以使不及物動詞變成及物動詞，比如：antworten（回答）, beantworten（答復）, urteilen（判斷，評價）, beurteilen（評價某物，鑒定某事）<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>

<ul class="org-ul">
<li>Ich wusste <b>auf</b> seine Frage sofort antworten.　我要對他的問題立刻做出回答。（不及物動詞）</li>
<li>Er beantwortet die Fragen blitzschnell.　他很快便回答了這個問題。（及物動詞）</li>
<li>Wer es nicht versucht, kann nicht urteilen. 不嘗試就無法評判。（不及物動詞）</li>
<li>Wie beurteilen Sie Ihre Fitness? 你如何評價你的健康狀況？（及物動詞）</li>
</ul>

<p>
第二，macht in Bildungen mit transitiven Verben mit Präpositionalobjekt dieses
zum Akkusativobjekt，通過添加 be- 使得及物動詞的支配關係發生變化。沒有 be- 的及物動詞直接支配第四格的賓語，而添加 be- 之後則先作用于第三格賓語再作用於第四格賓語：
</p>
<ul class="org-ul">
<li>Die Vögel bauen ihre Nester. 小鳥築巢。這裡的 bauen 是接受第四格賓語的動詞。</li>
<li>Er bebaut die Erde mit Kartoffeln. 他種在土裡一棵土豆。這裡的 bebauen 就是配合第三格賓語＋第四格賓語的動詞啦。</li>
</ul>

<p>
第三，When used with a verb that is already a transitive verb, it will change
the focus of the relationship.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> 改變及物動詞動作的關注點。比如 Ich streue
Salz auf mein Mettbrötchen. 我撒鹽在我的肉餡小麵包上。Ich bestreue mein
Mettbrötchen mit Salz. 我撒我的肉餡小麵包，用鹽。實在是有些費解，據說德國人也搞不清楚，其實就是一種約定俗成的語言習慣。
</p>


<p>
在分析了 nötig，nötigen 和 be- 之後，回到 benötigen 的探討。nötigen 好像是側重於對人的要求，或者說對主動主體的要求，而 benötigen 則側重於對被動主體的要求。換句話說，nötigen 是對人的要求，而 benötigen 是對物的要求。有點像中文中的“必須”和“必需”的區別。
</p>

<ul class="org-ul">
<li>Man benötigt ein Visum zur Einreise. 人們必需簽證才可入境。</li>
<li>Für diese Aufgabe benötigen wir jemanden mit besonderen Qualitäten. 對於此項任務，我們必需專業的資質。</li>
<li>Er nötigte den Freund zur Mahlzeit. 他一定要求請（必須）朋友去吃飯。</li>
<li>Er war zu der Unterschrift genötigt worden. 他被迫（被必須）簽了字。</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> Deviation</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.1</span> Nötigung</h3>
<div class="outline-text-3" id="text-2-1">
<p>
duress<sup>en</sup>，監禁，coercion<sup>en</sup>，壓制，compulsion<sup>en</sup>，強迫行為。
</p>

<ul class="org-ul">
<li>Er wurde wegen Nötigung verurteilt. 他因侵犯他人而被判刑。</li>
<li>sexuelle Nötigung: sexual assault<sup>en</sup>，侵犯。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.2</span> benötigte</h3>
<div class="outline-text-3" id="text-2-2">
<p>
required<sup>en</sup>，必需的
</p>

<ul class="org-ul">
<li>nicht mehr benötigte Arbeiter，冗餘員工</li>
<li>benötigte Reserven，required reserves</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://en.wiktionary.org/wiki/ben%C3%B6tigen">http://en.wiktionary.org/wiki/ben%C3%B6tigen</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.dedecn.com/inhalte/deutsch/deyucihui/20091231468.html">http://www.dedecn.com/inhalte/deutsch/deyucihui/20091231468.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.quora.com/Does-the-prefix-be-in-German-mean-something">https://www.quora.com/Does-the-prefix-be-in-German-mean-something</a>
</p></div></div>


</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#language-ref">
    		language <span>65</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#Deutsch-ref">Deutsch <span>17</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2016-08-12-xdotool" title="Linux 下用命令行工具 xdotool 模拟图形界面的鼠标键盘操作">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2016-08-14-english-food" title="单词本：食物">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

